Revit 2026 API

# ItemDataToolTip Property

---

The tooltip of item.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ToolTip { get; set; }
```
```vb
Public Property ToolTip As String
	Get
	Set
```
```cpp
public:
property String^ ToolTip {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ToolTip : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The text that is displayed when the mouse pointer moves over the item. SplitButton and RadioButtonGroup cannot display the tooltip set by this method, the SplitButton will always show the current PushButton tooltip, and RadioButtonGroup has no tooltip.

#### Reference

ItemData Class

Autodesk.Revit.UI Namespace